app/views/people/_form.html.erb

SELECT `cities`.* FROM `cities`
SELECT `states`.* FROM `states`
---
    <%= f.label :city_id %><br />
    <%= f.select :city_id, options_from_collection_for_select(@person.city.state.cities,"id","name",@person.city.id) %>