app/controllers/admin/sectors_controller.rb

  def index
    @sectors = Sector.all
---
SELECT `sectors`.* FROM `sectors`

  def show
    @sector = Sector.find(params[:id])
---
SELECT `sectors`.* FROM `sectors` WHERE `sectors`.`id` = 5 LIMIT 1

  def edit
    @sector = Sector.find(params[:id])
---
SELECT `sectors`.* FROM `sectors` WHERE `sectors`.`id` = 12 LIMIT 1

  def create
    @sector = Sector.new(params[:sector])
    respond_to do |format|
      if @sector.save
---
INSERT INTO `sectors` (`created_at`, `description`, `name`, `updated_at`) VALUES ('2013-09-03 19:49:50', 'testado loucamente', 'testando', '2013-09-03 19:49:50')

  def update
    @sector = Sector.find(params[:id])
---
SELECT `sectors`.* FROM `sectors` WHERE `sectors`.`id` = 124 LIMIT 1

  def destroy
    @sector = Sector.find(params[:id])
    @sector.destroy
---
SELECT `sectors`.* FROM `sectors` WHERE `sectors`.`id` = 215 LIMIT 1
DELETE FROM `sectors` WHERE `sectors`.`id` = 215