app/controllers/admin/skills_controller.rb

  def index
    @skills = Skill.all
---
SELECT `skills`.* FROM `skills`

  def edit
    @skill = Skill.find(params[:id])
---
SELECT `skills`.* FROM `skills` WHERE `skills`.`id` = 4 LIMIT 1

  def create
    @skill = Skill.new(params[:skill])

    respond_to do |format|
      if @skill.save
---
INSERT INTO `skills` (`created_at`, `description`, `name`, `score`, `sector_id`, `updated_at`) VALUES ('2013-09-03 19:10:24', 'ruby language', 'ruby', 0.0, 1, '2013-09-03 19:10:24')

  def update
    @skill = Skill.find(params[:id])

    respond_to do |format|
      if @skill.update_attributes(params[:skill])
---
SELECT `skills`.* FROM `skills` WHERE `skills`.`id` = 69 LIMIT 1
UPDATE `skills` SET `score` = 0.0, `updated_at` = '2013-09-03 19:26:10' WHERE `skills`.`id` = 70

  def destroy
    @skill = Skill.find(params[:id])
    @skill.destroy
---
SELECT `skills`.* FROM `skills` WHERE `skills`.`id` = 120 LIMIT 1
DELETE FROM `skills` WHERE `skills`.`id` = 120