app/controllers/courses_controller.rb

  def show
    @course = Course.find(params[:id])
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1

  def create
    @course = Course.new(params[:course])

    respond_to do |format|
      if @course.save
---
INSERT INTO `courses` (`created_at`, `description`, `name`, `updated_at`) VALUES ('2013-07-25 14:10:43', 'simplismente de foda', 'Engenharia da compucacao', '2013-07-25 14:10:43')