app/controllers/essays_controller.rb

  def index
    @essays = Essay.all
---
SELECT `essays`.* FROM `essays`

  def show
    @essay = Essay.find(params[:id])
---
SELECT `essays`.* FROM `essays` WHERE `essays`.`id` = 1 LIMIT 1

  def create
    @essay = Essay.new(params[:essay])

    respond_to do |format|
      if @essay.save
---
INSERT INTO `essays` (`created_at`, `level_id`, `question`, `reply`, `skill_id`, `updated_at`) VALUES ('2013-07-30 12:10:53', 1, 'faça uma função para retorno de um fatorial de 5', 'function lol', 1, '2013-07-30 12:10:53')

  def destroy
    @essay = Essay.find(params[:id])
    @essay.destroy
---
SELECT `essays`.* FROM `essays` WHERE `essays`.`id` = 2 LIMIT 1
DELETE FROM `essays` WHERE `essays`.`id` = 2