app/controllers/levels_controller.rb

SELECT `levels`.* FROM `levels`
---
  def index
    @levels = Level.all

SELECT `levels`.* FROM `levels` WHERE `levels`.`id` = 1 LIMIT 1
---
  def show
    @level = Level.find(params[:id])

INSERT INTO `levels` (`created_at`, `name`, `updated_at`) VALUES ('2013-07-30 11:57:44', 'Basico', '2013-07-30 11:57:44')
---
  def create
    @level = Level.new(params[:level])
    respond_to do |format|
      if @level.save