app/controllers/sectors_controller.rb

SELECT `sectors`.* FROM `sectors`
---
  def index
    @sectors = Sector.all

SELECT `sectors`.* FROM `sectors` WHERE `sectors`.`id` = 1 LIMIT 1
---
  def show
    @sector = Sector.find(params[:id])

SELECT `sectors`.* FROM `sectors` WHERE `sectors`.`id` = 1 LIMIT 1
---
  def edit
    @sector = Sector.find(params[:id])

INSERT INTO `sectors` (`created_at`, `description`, `name`, `updated_at`) VALUES ('2013-07-25 15:29:50', 'Desenvolvedores de backend na linguagem ruby, conhecedores de coffe script, rails, hame e etc...', 'Devoloper', '2013-07-25 15:29:50')
---
  def create
    @sector = Sector.new(params[:sector])

    respond_to do |format|
      if @sector.save

SELECT `sectors`.* FROM `sectors` WHERE `sectors`.`id` = 1 LIMIT 1
UPDATE `sectors` SET `description` = 'Desenvolvedores de backend na linguagem ruby, conhecedores de</br> coffe script, rails, hame e etc...', `updated_at` = '2013-07-25 15:30:18' WHERE `sectors`.`id` = 1
---
  def update
    @sector = Sector.find(params[:id])

    respond_to do |format|
      if @sector.update_attributes(params[:sector])