app/controllers/skills_controller.rb

  def index
    @skills = Skill.all
---
SELECT `skills`.* FROM `skills`

  def show
    @skill = Skill.find(params[:id])
---
SELECT `skills`.* FROM `skills` WHERE `skills`.`id` = 1 LIMIT 1

  def edit
    @skill = Skill.find(params[:id])
---
SELECT `skills`.* FROM `skills` WHERE `skills`.`id` = 1 LIMIT 1

  def create
    @skill = Skill.new(params[:skill])

    respond_to do |format|
      if @skill.save
---
INSERT INTO `skills` (`created_at`, `description`, `name`, `sector_id`, `updated_at`) VALUES ('2013-07-29 15:04:40', 'a', 'a', 1, '2013-07-29 15:04:40')

  def update
    @skill = Skill.find(params[:id])

    respond_to do |format|
      if @skill.update_attributes(params[:skill])
---
SELECT `skills`.* FROM `skills` WHERE `skills`.`id` = 1 LIMIT 1
UPDATE `skills` SET `name` = 'ruby', `description` = 'linguagem ruby', `updated_at` = '2013-07-29 16:48:55' WHERE `skills`.`id` = 1