app/controllers/universities_controller.rb

  def index
    @universities = University.all
---
SELECT `universities`.* FROM `universities`

  def show
    @university = University.find(params[:id])
---
SELECT `universities`.* FROM `universities` WHERE `universities`.`id` = 1 LIMIT 1

  def edit
    @university = University.find(params[:id])
---
SELECT `universities`.* FROM `universities` WHERE `universities`.`id` = 1 LIMIT 1

  def create
    @university = University.new(params[:university])

    respond_to do |format|
      if @university.save
---
INSERT INTO `universities` (`address`, `city_id`, `created_at`, `district`, `name`, `phone`, `state_id`, `updated_at`, `zip_code`) VALUES ('x', 8663, '2013-07-23 15:20:53', 'x', 'Uni Toledo', '(18) 3622-7000', 26, '2013-07-23 15:20:53', 'x')

  def update
    @university = University.find(params[:id])

    respond_to do |format|
      if @university.update_attributes(params[:university])
---
SELECT `universities`.* FROM `universities` WHERE `universities`.`id` = 1 LIMIT 1
UPDATE `universities` SET `state_id` = 26, `city_id` = 8663, `phone` = '(18)3636-5252', `address` = 'Rod. Teotônio Vilela, 3821', `district` = 'Alvorada ', `zip_code` = '16016-500', `updated_at` = '2013-07-25 12:48:40' WHERE `universities`.`id` = 1