app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `email`, `password`, `updated_at`) VALUES ('2013-07-30 14:09:21', 'victhorweb@gmail.com', 'bcaf65b8b6c0569f292cacec905d789edfccd66b', '2013-07-30 14:09:21')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save