app/controllers/vacants_controller.rb

  def index
    @vacants = Vacant.all
---
SELECT `vacants`.* FROM `vacants`

  def show
    @vacant = Vacant.find(params[:id])
---
SELECT `vacants`.* FROM `vacants` WHERE `vacants`.`id` = 1 LIMIT 1

  def create
    @vacant = Vacant.new(params[:vacant])
    respond_to do |format|
      if @vacant.save
---
INSERT INTO `vacants` (`created_at`, `date_end`, `description`, `sector_id`, `title`, `updated_at`) VALUES ('2013-07-29 16:44:40', '2013-07-29', 'asdfasdf', 4, 'sda\\fasdf', '2013-07-29 16:44:40')

  def destroy
    @vacant = Vacant.find(params[:id])
    @vacant.destroy
---
SELECT `vacants`.* FROM `vacants` WHERE `vacants`.`id` = 1 LIMIT 1
DELETE FROM `vacants` WHERE `vacants`.`id` = 1